Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: imagecharup() draws the character c vertically in the image identified by image at coordinates x, y (top left is 0, 0) with the color col.
es: ImageCharUp dibuja el caracter c verticalmente en la imagen identificado como im en las coordenadas x, y (arriba izquierda es 0,0) con el color col.

source: If font is 1, 2, 3, 4 or 5, a built-in font is used.
es: Si la fuente es 1, 2, 3, 4 o 5 se usa una fuente predefinida.

source: imagecolorallocate() returns a color identifier representing the color composed of the given RGB components.
es: ImageColorAllocate devuelve un identificador del color representado por la mezcla de los componentes RGB dados.

source: The im argument is the return from the imagecreate() function. red, green and blue are the values of the red, green and blue component of the requested color respectively.
es: El parámetro im es el resultado de la función imagecreate().

source: These parameters are integers between 0 and 255. imagecolorallocate() must be called to create each color that is to be used in the image represented by image.
es: ImageColorAlocate tiene que ser invocada para crear cada color que va a ser usado por la imagen que representa im.

source: Returns -1 if the allocation failed.
es: $white = ImageColorAllocate( $im, 255,255,255); $black = ImageColorAllocate($im, 0,0,0);

source: Use bitshifting and masking to access the distinct red, green and blue component values:
es: Devuelve el índice del color del pixel especificado en la posición de la imagen.

source: See also imagecolorset() and imagecolorsforindex().
es: Vea también imagecolorset() y imagecolorsforindex().

source: Returns the index of the color in the palette of the image which is "closest" to the specified RGB value.
es: Devuelve el índice del color de la paleta de la imagen que sea más "cercano" al valor RGB especificado.

source: The "distance" between the desired color and each color in the palette is calculated as if the RGB values represented points in three-dimensional space.
es: La "distancia" entre el color deseado y cada color de la paleta es calculada como si los valores RGB representasen puntos en un espacio tridimensional.

source: See also imagecolorexact().
es: Vea también imagecolorexact().

source: This function is currently not documented; only the argument list is available.
es: Esta función no está documentada actualmente, solamente se encuentra disponible la lista de parametros.

source: Returns the index of the specified color in the palette of the image.
es: Devuelve el índice del color especificado de la paleta de la imagen.

source: If the color does not exist in the image 's palette, -1 is returned.
es: Si el color no existe en la paleta de la imagen, se devuelve el valor -1.

source: See also imagecolorclosest().
es: Vea también imagecolorclosest().

source: This function is guaranteed to return a color index for a requested color, either the exact color or the closest possible alternative.
es: Esta función garantiza el resultado de un índice de color para un color solicitado, ya sea el color exacto o su alternativa más cercana.

source: This sets the specified index in the palette to the specified color.
es: Establece el índice especificado de la paleta con el color introduciod.

source: This is useful for creating flood-fill-like effects in paletted images without the overhead of performing the actual flood-fill.
es: Esto es útil para crear efectos de rellenado en imagenes con paletas sin la sobrecarga de tener que realizar el rellenado.

source: See also imagecolorat().
es: Vea también imagecolorat().

source: This returns an associative array with red, green, and blue keys that contain the appropriate values for the specified color index.
es: Devuelve una matriz asociativa con las claves red, green y blue que contienen los valores apropiados para el color especificado en el índice.

source: See also imagecolorat() and imagecolorexact().
es: Vea también imagecolorat() y imagecolorexact().

source: This returns the number of colors in the specified image 's palette.
es: Encuentra el número de colores de la paleta de una imagen.

source: See also imagecolorat() and imagecolorsforindex().
es: Vea también imagecolorat() y imagecolorsforindex().

source: The identifier of the new (or current, if none is specified) transparent color is returned.
es: Se devuelve el identificador del color transparente (o el actual, si no se especifica ninguno).

source: Dst_im is the destination image, src_im is the source image identifier.
es: imagecopyresampled() copia una porción rectangular de una imagen sobre otra, suavizando los valores de los píxeles mediante interpolación, de forma que al reducir el tamaño de una imagen aún mantiene una buena claridad. img_dst es la imagen de destino, img_org imagecopyresampled() copia una porción rectangular de una imagen sobre otra, suavizando los valores de los píxeles mediante interpolación, de forma que al reducir el tamaño de una imagen aún mantiene una buena claridad. img_dst es la imagen de destino, img_org es el identificador de la imagen de origen.

source: If the source and destination coordinates and width and heights differ, appropriate stretching or shrinking of the image fragment will be performed.
es: Si las coordenadas de origen y destino y ancho y alto son diferentes, se encogerá o agrandará el fragmento de imagen según sea necesario.

source: The coordinates refer to the upper left corner.
es: Las coordenadas son relativas a la esquina superior izquierda.

source: This function can be used to copy regions within the same image (if dst_im is the same as src_im) but if the regions overlap the results will be unpredictable.
es: Esta función se puede usar para copiar regiones dentro de la misma imagen (si img_dst es la misma que img_org) pero si las regiones se superponen, los resultados serán impredecibles.

source: With a palette image we try to allocate a new color, if that failed, we choose the closest (in theory) computed color.
es: Vea también imagecopyresized().

source: See also imagecopyresized().
es: Esta función fue añadida en PHP 4.0.6 y requiere GD 2.0.1 o superior

source: To skip this problem, please use a truecolor image as a destination image, such as one created by imagecreatetruecolor().
es: Esta función se puede usar para copiar regiones dentro de la misma imagen (si dst_im es igual que src_im) pero si las regiones se solapan los resultados seran impredecibles.

source: Tip:
es: Sugerencia:

source: You can use a URL as a filename with this function if the fopen wrappers have been enabled.
es: Puede usar una URL como nombre de archivo con esta función si los "fopen wrappers" han sido activados.

source: Windows versions of PHP prior to PHP 4.3 do not support accessing remote files via this function, even if allow_url_fopen is enabled.
es: La versión actual de PHP para Windows, no soporta el acceso remoto a ficheros en esta función, no funcionará incluso activando allow_url_fopen.

source: imagecreatefromgif() returns an empty string on failure.
es: imagecreatefromgif() devuelve un identificador de imagen representando la imagen obtenida del nombre del fichero dado.

source: It also outputs an error message, which unfortunately displays as a broken link in a browser.
es: imagecreatefromgif() devuelve una cadena vacia si hay algun fallo.

source: Example to handle an error during creation (courtesy vic@zymsys.com)
es: Para depurarlo fácilmente el siguiente ejemplo producirá un error de GIF:

source: imagecreatefromjpeg() returns an empty string on failure.
es: imagecreatefromjpeg() devuelve un identificador de imagen que representa a la imagen obtenida a partir del nombre de archivo indicado.

source: imagecreatefrompng() returns an empty string on failure.
es: imagecreatefrompng() devuelve un identificador de imagen que representa a la imagen obtenida a partir del nombre de archivo indicado.

source: We recommend the use of imagecreatetruecolor().
es: ImageCreate devuelve un identificador de imagen representando una imagen en blanco de tamaño x_size por y_size.

source: This function was added in PHP 4.0.6 and requires GD 2.0.1 or later
es: Nota:

source: This function will not work with GIF file formats.
es: Esta función fue añadida en PHP 4.0.6 y requiere GD 2.0.1 o superior

source: Use combination of imagesetstyle() and imageline() instead.
es: Vea también imageline().

source: imagedestroy() frees any memory associated with image image. image is the image identifier returned by the imagecreate() function.
es: ImageDestroy libera la memoria asociada a la imagen im. im es la imagen devuelta por la función imagecreate().

source: imagefilledpolygon() creates a filled polygon in image image. points is a PHP array containing the polygon's vertices, ie. points[0] = x0, points[1] = y0, points[2] = x1, points[3] = y1, etc. num_points is the total number of vertices.
es: ImageFilledPolygon crea un polígono relleno en la imagen im, points es una matriz PHP conteniendo los vértices del poligono, por ejemplo. points[ 0] = x0, points[1] = y0, points[2] = x1, points[3] = y1, etc. num_points es el número total de vértices.

source: imagefilledrectangle() creates a filled rectangle of color col in image image starting at upper left coordinates x1, y1 and ending at bottom right coordinates x2, y2.
es: ImageFilledRectangle crea un rectángulo relleno con color col en la imagen im comenzando con las coordenadas superiores izquierdas x1, y1 y finalizando en las coordenadas inferiores derechas x2, y2.

source: 0, 0 is the top left corner of the image.
es: 0,0 es la esquina superior izquierda de la imagen.

source: imagefill() performs a flood fill starting at coordinate x, y (top left is 0, 0) with color col in the image image.
es: ImageFill realiza un relleno empezando en la coordenada x,y (arriba izquierda es 0,0) con el color col en la imagen im.

source: imagefilltoborder() performs a flood fill whose border color is defined by border.
es: ImageFillToBorder realiza un relleno hasta el color del borde que está definido por border.

source: The starting point for the fill is x, y (top left is 0, 0) and the region is filled with color col.
es: El punto de inicio para el relleno es x,y (arriba izquierda es 0,0) y la región se rellena con el color col.

source: Returns the pixel height of a character in the specified font.
es: Devuelve la altura en pixels de un carácter en un fuente específica.

source: See also imagefontwidth() and imageloadfont().
es: Vea también imagefontwidth() y imageloadfont().

source: Returns the pixel width of a character in font.
es: Devuelve la anchura en pixels de un carácter en un fuente específica.

source: See also imagefontheight() and imageloadfont().
es: Vea también imagefontheight() y imageloadfont().

source: The image argument is the return from the imagecreate() function.
es: imagegif() crea el fichero GIF en filename a partir de la imagen im.

source: The image format will be GIF87a unless the image has been made transparent with imagecolortransparent(), in which case the image format will be GIF89a.
es: El parámetro im es el resultado de usar la función imagecreate().

source: By sending an image / gif content-type using header(), you can create a PHP script that outputs GIF images directly.
es: El formato de la imagen será GIF87a a menos que la imagen se halla hecho transparente con imagecolortransparent(), en cuyo caso el formato de la imagen será GIF89a.

source: Since all GIF support was removed from the GD library in version 1.6, this function is not available if you are using that version of the GD library.
es: El parametro del nombre del fuichero es opcional, y si se deja en blanco, la imagen será mostrada directamente.

source: The following code snippet allows you to write more portable PHP applications by auto-detecting the type of GD support which is available.
es: Enviando un tipo de imagen / gif usando la función header(), puede crear un script PHP que muestre imagenes GIF directamente.

source: ?php if (function_exists("imagegif")) {header ("Content-type: image / gif"); imagegif ($im);} elseif (function_exists("imagejpeg")) {header ("Content-type: image / jpeg"); imagejpeg ($im, "", 0.5);} elseif (function_exists("imagepng")) {header ("Content-type: image / png"); imagepng ($im);} elseif (function_exists("imagewbmp")) {header ("Content-type: image / vnd.wap.wbmp"); imagewbmp ($im);} else die("No image support in this PHP server");?
es: Nota:

source: if (imagetypes() IMG_GIF) {header ("Content-type: image / gif"); imagegif ($im);} elseif (imagetypes() IMG_JPG) {... etc.
es: Desde que todo el soporte a GIFs ha sido eliminado en la libreria GD a partir de la versión 1.6, esta función no está disponible si está usando esa versión de la libreria GD.

source: imageinterlace() turns the interlace bit on or off.
es: ImageInterlace() activa o desactiva el bit de entrelazado.

source: If interlace is 1 the image will be interlaced, and if interlace is 0 the interlace bit is turned off.
es: Si interlace es 1 la imagen im será entrelazada, y si interlace es 0 el bit de entrelazado se desactiva.

source: This function returns whether the interlace bit is set for the image.
es: Esta función devuelve como ha cambiado el estado del bit de entralazado de la imagen.

source: imageline() draws a line from x1, y1 to x2, y2 (top left is 0, 0) in image im of color col.
es: ImageLine dibuja una línea desde x1,y1 hasta x2,y2 (arriba izquierda es 0,0) en la imagen im con el color col.

source: See also imagecreate() and imagecolorallocate().
es: Vea también imagecreate() y imagecolorallocate().

source: imageloadfont() loads a user-defined bitmap font and returns an identifier for the font (that is always greater than 5, so it will not conflict with the built-in fonts).
es: ImageLoadFont carga una fuente de bitmaps definida por el usuario y devuelve un identificador para esa fuente (que siempre es mayor de 5, de forma que no pueda entrar en conflicto con las fuentes predefinidas)..

source: The font file format is currently binary and architecture dependent.
es: El formato del fichero de la fuente es actualmente binario y dependiente de la arquitectura.

source: This means you should generate the font files on the same type of CPU as the machine you are running PHP on.
es: Esto significa que tiene que generar los ficheros de las fuentes en el mismo tipo de CPU que la que tiene la máquina que está ejecutando PHP.

source: Table 1.
es: Tabla 1.

source: Font file format
es: Formato del fichero de fuentes

source: byte position
es: Posición en bytes

source: C data type
es: tipo de datos C

source: description
es: Descripción

source: number of characters in the font
es: número de carácteres en la fuente

source: value of first character in the font (often 32 for space)
es: valor del primer carácter de la fuente (normalmente 32 para el espacio)

source: pixel width of each character
es: Anchura en pixels de cada carácter

source: pixel height of each character
es: Altura en pixels de cada carácter

source: array with character data, one byte per pixel in each character, for a total of (nchars*width*height) bytes.
es: matriz con los datos del carácter, un byte por pixel en cada carácter, haciendo un total de (número carácteres* altura*anchura) bytes.

source: See also imagefontwidth() and imagefontheight().
es: Vea también ImageFontWidth() y ImageFontHeight().

source: imagepolygon() creates a polygon in image id. points is a PHP array containing the polygon's vertices, ie. points[0] = x0, points[1] = y0, points[2] = x1, points[3] = y1, etc. num_points is the total number of points (vertices).
es: ImagePolygon crea un polígono en la imagen id. points es un array PHP conteniendo los vértices del polígono. de la siguiente forma points[ 0] = x0, points1 = y0, points[2] = x1, points[3] = y1, etc. num_points es el número total de vértices.

source: See also imagecreate() and imagecreatetruecolor().
es: Vea también imagecreate().

source: Size is expressed in pixels.
es: size representa pixels.

source: Space allows you to change the default value of a space in a font.
es: space perimte cambiar el valor por defecto de un espacio en una fuentes.

source: This amount is added to the normal value and can also be negative.
es: Este valor es añadido al valor normal y puede ser negativo.

source: Tightness allows you to control the amount of white space between characters.
es: tightness permite controlar la cantidad de espacio en blanco entre carácteres.

source: This amount is added to the normal character width and can also be negative.
es: Este valor se añade a la anchura normal del carácter y puede ser negativo.

source: Angle is in degrees.
es: angle viene dado en grados.

source: Parameters space and tightness are expressed in character space units, where 1 unit is 1 / 1000th of an em-square.
es: Los parámetros space y tightness vienen expresados en unidades de espacio de carácteres, donde una unidad es 1 / 1000 el borde de una M.

source: Parameters space, tightness, and angle are optional.
es: Los parámetros space, tightness y angle son opcionales.

source: The bounding box is calculated using information available from character metrics, and unfortunately tends to differ slightly from the results achieved by actually rasterizing the text.
es: El borde es calculado usando la información disponible de las métricas del carácter, y desafortunadamente tiende a diferir ligeramente de los resultados obtenidos de digitalizar el texto.

source: If the angle is 0 degrees, you can expect the text to need 1 pixel more to every direction.
es: Si el ángulo es de 0 grados, puede esperar que el texto necesite un pixel más en cada dirección.

source: This function returns an array containing the following elements:
es: Esta función devuelve un array conteniuendo los siguientes elementos:

source: lower left x-coordinate
es: coordenada x inferior izquierda

source: lower left y-coordinate
es: coordenada y inferior izquierda

source: upper right x-coordinate
es: coordenada x superior derecha

source: upper right y-coordinate
es: coordenada y superior derecha

source: See also imagepstext().
es: Vea también imagepstext().

source: Use this function if you need make further modifications to the font, for example extending / condensing, slanting it or changing it 's character encoding vector, but need to keep the original along as well.
es: Use esta función si necesita hacer modificaciones en la fuente, por ejemplo expander / condensar, inclinarla o cambiar su vector de codificación de caracteres, pero también necesita mantener la fuente original.

source: Note that the font you want to copy must be one obtained using imagepsloadfont(), not a font that is itself a copied one.
es: Note que la fuente que quiera copiar debe haber sido obtenida usando imagepsloadfont(), no una fuente que sea una copia de otra.

source: You can although make modifications to it before copying.
es: Aunque puede hacer modificaciones antes de copiarla.

source: If you use this function, you must free the fonts obtained this way yourself and in reverse order.
es: Si usa esta función, debe liberar las fuentes obtenidas de esta manera.

source: Otherwise your script will hang.
es: De otra forma su script se colgará.

source: In the case everything went right, a valid font index will be returned and can be used for further purposes.
es: En el caso de que todo vaya bien, devolverá un índice de fuente válido que puede ser usado para futuos propósitos.

source: Otherwise the function returns FALSE and prints a message describing what went wrong.
es: De otra forma la función devolverá FALSE e imprimirá un mensaje indicando que es lo que ha ido mal.

source: See also imagepsloadfont().
es: Vea también imageploadpsfont().

source: Loads a character encoding vector from from a file and changes the fonts encoding vector to it.
es: Carga un vector de codificación de caracteres desde un archivo y cambia el vector de codificación de las fuentes a él.

source: The exact format of this file is described in T1libs documentation.
es: En las fuentes PostScript normalmente faltan muchos caracteres por encima de 127, seguramente quiera cambiar esto si emplea u idioma distinto del inglés.El formato exacto de este archivo está descrito en la documentación de T1libs.

source: T1lib comes with two ready-to-use files, IsoLatin1.enc and IsoLatin2.enc.
es: T1lib viene con dos archivos listos para usar, IsoLatin1.enc y IsoLatin2.enc.

source: If you find yourself using this function all the time, a much better way to define the encoding is to set ps.default_encoding in the configuration file to point to the right encoding file and all fonts you load will automatically have the right encoding.
es: Si se encuentra usando esta función todo el tiempo, una forma mucho mejor de definir la codificación es establecer ps.default_encoding en el archivo de configuración para que apunte al archivo de codificación correcto y todas las fuentes que cargue tendrán de forma automática la codificación correcta.

source: Otherwise the function returns FALSE and prints a message describing what went wrong, which you cannot read directly, while the output type is image.
es: En caso contrario la función devuelve FALSE e imprime un mensaje describiendo donde ha fallado

source: It worked !", $font, 32, $white, $black, 32, 32); imagepsfreefont ($font); imagejpeg ($im, "", 100); / /for best quality...your mileage may vary imagedestroy ($im);?
es: Vea también imagepsfreefont().

source: Background is the color to which the text will try to fade in with antialiasing.
es: foreground es el color en el cual el texto será pintado. background es el color en el que el texto tratará de resaltar con antialiaing.

source: No pixels with the color background are actually painted, so the background image does not need to be of solid color.
es: Los pixels con el color background no se pintan, de forma que la imagen de fondo no necesita ser de un color sólido.

source: The coordinates given by x, y will define the origin (or reference point) of the first character (roughly the lower-left corner of the character).
es: Las coordenadas dadas por x, y definirán el origen (o punto de referencia) del primer carácter (la esquina superior izquierda del carácter).

source: This is different from the imagestring(), where x, y define the upper-right corner of the first character.
es: Esto es diferente de la función ImageString(), donde x, y definen la esquina superiro derecha del primer carácter.

source: Refer to PostScipt documentation about fonts and their measuring system if you have trouble understanding how this works.
es: Consulte la documentación de PostScript sobre fuentes y su sistema de medidas si tiene algún problema entendiendo como funcion.

source: Antialias_steps allows you to control the number of colours used for antialiasing text.
es: antialias_steps antialias_steps permite controlar el número de colores usados para el antialising del texto.

source: Allowed values are 4 and 16.
es: Los valores permitidos son 4 y 16.

source: The higher value is recommended for text sizes lower than 20, where the effect in text quality is quite visible.
es: El valor superior está recomendado para textos con tamaños inferiores a 20, donde el efecto en la calidad del texto es bastante visible.

source: With bigger sizes, use 4.
es: Con tamaños superiores use 4.

source: It 's less computationally intensive.
es: Hace un menor uso de cálculo.

source: Parameters space, tightness, angle and antialias are optional.
es: Los parámetros space, tightness, angle y antialias son opcionales.

source: See also imagepsbbox().
es: Vea también imagepsbbox().
